lvx/base/Documents/бит_ОперацияУправленческий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>бит_ОперацияУправленческий</Name>
			<Posting>Deny</Posting>
			<RegisterRecords>
				<xr:Item>AccountingRegister.бит_Дополнительный_4</xr:Item>
				<xr:Item>AccumulationRegister.бит_ОборотыПоБюджетам</xr:Item>
				<xr:Item>AccountingRegister.бит_Дополнительный_3</xr:Item>
				<xr:Item>AccountingRegister.бит_Дополнительный_1</xr:Item>
				<xr:Item>AccumulationRegister.бит_СоответствиеОборотовТрансляции</xr:Item>
				<xr:Item>AccumulationRegister.бит_ОборотыПоТипамПроводок</xr:Item>
				<xr:Item>AccountingRegister.бит_Бюджетирование</xr:Item>
				<xr:Item>AccountingRegister.бит_Дополнительный_5</xr:Item>
				<xr:Item>AccountingRegister.бит_Дополнительный_2</xr:Item>
				<xr:Item>InformationRegister.бит_СоответствиеЗаписейТрансляции</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>РегистрБухгалтерии</Name>
					<Comment>Имя регистра бухгалтерии</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ОбъектыСистемы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Comment>Организация</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаОперацииРегл</Name>
					<Comment>Сумма операции (регл)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаОперацииУпр</Name>
					<Comment>Сумма операции (упр)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаОперацииМУ</Name>
					<Comment>Сумма операции (МСФО)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Содержание</Name>
					<Comment>Содержание</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Comment>Пользователь, ответственный за заполнение данного документа</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипПроводок</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ТипыПроводок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСторно</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

lvx/base/Documents/бит_ОперацияУправленческий/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// СтандартныеПодсистемы.ВерсионированиеОбъектов

// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
//  Настройки	 - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

// СтандартныеПодсистемы.Печать

// Переопределяет настройки печати для объекта.
//
// Параметры:
//  Настройки - см. УправлениеПечатью.НастройкиПечатиОбъекта.
//
Процедура ПриОпределенииНастроекПечати(Настройки) Экспорт
	
	Настройки.ПриДобавленииКомандПечати = Истина;
		
КонецПроцедуры

// Заполняет список команд печати.
//
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
			
	// Операция (управленческий).
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор	= "УправленческаяОперация";
	КомандаПечати.Представление	= НСтр("ru='Операция (управленческий)';en='Transaction (managerial)'");
	Если НЕ бит_ОбщегоНазначения.ЭтоУТ() Тогда
		// АПК:277-выкл Поставщик библиотеки не разбил модуль на области.
		КомандаПечати.Обработчик = "УправлениеПечатьюБПКлиент.ВыполнитьКомандуПечати";
		// АПК:277-вкл 
	КонецЕсли;
	КомандаПечати.Порядок		= 10;	
	
КонецПроцедуры

// Формирует печатные формы.
//
// Параметры:
//  МассивОбъектов  - Массив    - ссылки на объекты, которые нужно распечатать;
//  ПараметрыПечати - Структура - дополнительные настройки печати;
//  КоллекцияПечатныхФорм - ТаблицаЗначений - сформированные табличные документы (выходной параметр)
//  ОбъектыПечати         - СписокЗначений  - значение - ссылка на объект;
//                                            представление - имя области в которой был выведен объект (выходной параметр);
//  ПараметрыВывода       - Структура       - дополнительные параметры сформированных табличных документов (выходной параметр).
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "УправленческаяОперация") Тогда					
		// Формируем табличный документ и добавляем его в коллекцию печатных форм.
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, 
			"УправленческаяОперация",
			НСтр("ru='Операция (управленческий)';en='Transaction (managerial)'"), 
			СформироватьПечатнуюФормуУправленческаяОперация(МассивОбъектов),,
			"Документ.бит_ОперацияУправленческий.УправленческаяОперация");
	КонецЕсли;
	
	// АПК:277-выкл Поставщик библиотеки не разбил модуль на области.
	ОбщегоНазначенияБП.ЗаполнитьДополнительныеПараметрыПечати(МассивОбъектов, КоллекцияПечатныхФорм, ОбъектыПечати,
		ПараметрыВывода);		
	// АПК:277-вкл 
         
КонецПроцедуры

// СтандартныеПодсистемы.Печать

// Функция определяет новый статус объекта.
// Механизм определения статусов может быть переопределен алгоритмами.
//
// Параметры:
//  ТекущийОбъект - ДокументОбъект.бит_ОперацияУправленческий.
//  ПараметрыУстановкиСтатуса - Структура - состав полей см. в функции бит_ВизированиеСервер.НовыеПараметрыУстановкиСтатуса.
//
// Возвращаемое значение:
//   СправочникСсылка.бит_СтатусыОбъектов - новый статус объекта.
//
Функция НовыйСтатусОбъекта(ТекущийОбъект, ПараметрыУстановкиСтатуса) Экспорт
	
	Возврат бит_ВизированиеСервер.НовыйСтатусПоСтандартномуАлгоритму(ТекущийОбъект, ПараметрыУстановкиСтатуса);
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Функция получает результат основного запроса по бюджетной операции.
// 
// Параметры:
//  МассивСсылок - Массив.
//  
// Возвращаемое значение:
//   Результат запроса
// 
Функция ПолучитьРезультатЗапросаПоУправленческойОперации(Ссылка, ИмяРегистраБухгалтерии, лЕстьРесурсСуммаМУ)

	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	ТекстЗапроса = "
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	УправленческийДвиженияССубконто.Регистратор КАК Ссылка,
	|	УправленческийДвиженияССубконто.НомерСтроки КАК НомерСтроки,
	|	УправленческийДвиженияССубконто.Организация,
	|	УправленческийДвиженияССубконто.СчетДт,
	|	УправленческийДвиженияССубконто.СубконтоДт1,
	|	УправленческийДвиженияССубконто.СубконтоДт2,
	|	УправленческийДвиженияССубконто.СубконтоДт3,
	|	УправленческийДвиженияССубконто.СубконтоДт4,
	|	УправленческийДвиженияССубконто.СчетКт,
	|	УправленческийДвиженияССубконто.СубконтоКт1,
	|	УправленческийДвиженияССубконто.СубконтоКт2,
	|	УправленческийДвиженияССубконто.СубконтоКт3,
	|	УправленческийДвиженияССубконто.СубконтоКт4,
	|	УправленческийДвиженияССубконто.ВалютаДт,
	|	УправленческийДвиженияССубконто.ВалютаКт,
	|	УправленческийДвиженияССубконто.СуммаРегл,
	|	УправленческийДвиженияССубконто.СуммаУпр,
	|";
	
	Если лЕстьРесурсСуммаМУ Тогда
		ТекстЗапроса = ТекстЗапроса + "
		|	УправленческийДвиженияССубконто.СуммаМУ,
		|";
	КонецЕсли;
	
	ТекстЗапроса = ТекстЗапроса + "
	|	УправленческийДвиженияССубконто.ВалютнаяСуммаДт,
	|	УправленческийДвиженияССубконто.ВалютнаяСуммаКт,
	|	УправленческийДвиженияССубконто.КоличествоДт,
	|	УправленческийДвиженияССубконто.КоличествоКт,
	|	УправленческийДвиженияССубконто.Содержание
	|ИЗ
	|	РегистрБухгалтерии." + ИмяРегистраБухгалтерии + ".ДвиженияССубконто(, , Регистратор = &Ссылка) КАК УправленческийДвиженияССубконто
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки
	|";
	
	Запрос.Текст = ТекстЗапроса;
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса;
		
КонецФункции

// Функция формирует печатную форму бюджетной операции.
// 
// Параметры:
//  МассивСсылок  		   - Массив.
// 
// Возвращаемое значение:
//  ТабличныйДокумент - ТабличныйДокумент.
// 
Функция СформироватьПечатнуюФормуУправленческаяОперация(МассивСсылок)
	
	// Текущий документ	
	ТекДокумент = МассивСсылок[0];
		
	ИмяРегистраБухгалтерии = ТекДокумент.РегистрБухгалтерии.ИмяОбъекта;
	// Проверим наличие ресурса с именем "СуммаМУ".
	лЕстьРесурсСуммаМУ  = бит_ОбщегоНазначения.ЕстьРесурсСуммаМУРегистраБухгалтерии(ИмяРегистраБухгалтерии);
	// Количество субконто
	лКоличествоСубконто = 4;
	// Спиосок регистров
	лСписокРегистров = бит_УправленческийУчет.СформироватьСписокОбъектовДляВыбора(Перечисления.бит_ВидыОбъектовСистемы.РегистрБухгалтерии, "бит_Дополнительный");
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.КлючПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_бит_ОперацияУправленческий_УправленческаяОперация";
			
	// Формируем запрос по документам.
	РезультатЗапроса = ПолучитьРезультатЗапросаПоУправленческойОперации(ТекДокумент, ИмяРегистраБухгалтерии, лЕстьРесурсСуммаМУ);
	
	Если Не РезультатЗапроса.Пустой() Тогда
		
		// Получаем макет и области.
		Макет = ПолучитьМакет("УправленческаяОперация");
		// Получаем области
		ОбластьШапка 			= Макет.ПолучитьОбласть("Шапка");
		ОбластьЗаголовокТаблицы = Макет.ПолучитьОбласть("ЗаголовокТаблицы");
		ОбластьСтрокаТаблицы  	= Макет.ПолучитьОбласть("СтрокаТаблицы");
		ОбластьПодвалТаблицы    = Макет.ПолучитьОбласть("ПодвалТаблицы");
		ОбластьПодвал  	 	 	= Макет.ПолучитьОбласть("Подвал");
		
		// Вывод результатов
		ПервыйДокумент   = Истина;     		
							
		// Разделитель страниц
		Если Не ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ПервыйДокумент = Ложь;
		
		// Текущий документ
		
		// Выведем шапку документа.
		// АПК:277-выкл Поставщик библиотеки не разбил модуль на области.
		СведенияОбОрганизации = БухгалтерскийУчетПереопределяемый.СведенияОЮрФизЛице(ТекДокумент.Организация, ТекДокумент.Дата);
		// АПК:277-вкл 
		// Заполним представление регистра бухгалтерии.
		ПредставлениеРегистра = бит_ПраваДоступа.ПолучитьПредставлениеОбъектаСистемыИзСпискаЗначений(лСписокРегистров, ТекДокумент.РегистрБухгалтерии);
		
		ОбластьШапка.Параметры.Организация    	     = бит_ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОбОрганизации);
		ОбластьШапка.Параметры.ПредставлениеРегистра = ПредставлениеРегистра;
		ОбластьШапка.Параметры.НомерДокумента 	     = ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(ТекДокумент.Номер, Истина, Истина);
		ОбластьШапка.Параметры.ДатаДокумента  	     = Формат(ТекДокумент.Дата, "ДЛФ=D");
		ОбластьШапка.Параметры.Содержание     	     = ТекДокумент.Содержание;
		
		ТабличныйДокумент.Вывести(ОбластьШапка);
		
		ТекстСуммаЗТ = "Регл." + Символы.ПС + "Упр." + ?(лЕстьРесурсСуммаМУ, Символы.ПС + "МСФО", "");
		ОбластьЗаголовокТаблицы.Параметры.ТекстСумма = ТекстСуммаЗТ;
		
		// Выведем заголовок таблицы.
		ТабличныйДокумент.Вывести(ОбластьЗаголовокТаблицы);
		
		// Вывод таблицы движений
		ВыборкаИзЗапросаДвижения = РезультатЗапроса.Выбрать();
		Пока ВыборкаИзЗапросаДвижения.Следующий() Цикл
			
			ОбластьСтрокаТаблицы.Параметры.Заполнить(ВыборкаИзЗапросаДвижения);
			
			ТекстСуммаСТ = "" + бит_ОбщегоНазначения.ФорматСумм(ВыборкаИзЗапросаДвижения.СуммаРегл) + Символы.ПС
			+ бит_ОбщегоНазначения.ФорматСумм(ВыборкаИзЗапросаДвижения.СуммаУпр) 
			+ ?(лЕстьРесурсСуммаМУ, Символы.ПС + бит_ОбщегоНазначения.ФорматСумм(ВыборкаИзЗапросаДвижения.СуммаМУ), "");
			
			ОбластьСтрокаТаблицы.Параметры.ТекстСумма = ТекстСуммаСТ;
			
			АналитикаДт = "";
			АналитикаКт = "";
			
			Для Ном = 1 По лКоличествоСубконто Цикл
				
				АналитикаДт = бит_СтрокиКлиентСервер.ДобавитьСтрокуСРазделителем(АналитикаДт, ВыборкаИзЗапросаДвижения["СубконтоДт" + Ном], Символы.ПС);
				АналитикаКт = бит_СтрокиКлиентСервер.ДобавитьСтрокуСРазделителем(АналитикаКт, ВыборкаИзЗапросаДвижения["СубконтоКт" + Ном], Символы.ПС);
				
			КонецЦикла;
			
			ОбластьСтрокаТаблицы.Параметры.АналитикаДт = АналитикаДт;
			ОбластьСтрокаТаблицы.Параметры.АналитикаКт = АналитикаКт;
			
			// Проверим, помещается ли строка с подвалом.
			СтрокаСПодвалом = Новый Массив;
			СтрокаСПодвалом.Добавить(ОбластьСтрокаТаблицы);
			СтрокаСПодвалом.Добавить(ОбластьПодвалТаблицы);
			СтрокаСПодвалом.Добавить(ОбластьПодвал);
			
			Если НЕ бит_ФормированиеПечатныхФорм.ПроверитьВыводТабличногоДокумента(ТабличныйДокумент, СтрокаСПодвалом) Тогда
				
				// Выведем подвал таблицы.
				ТабличныйДокумент.Вывести(ОбластьПодвалТаблицы);
				
				// Выведем разрыв страницы.
				ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
				
				// Выведем заголовок таблицы.
				ТабличныйДокумент.Вывести(ОбластьЗаголовокТаблицы);
				
			КонецЕсли;
			
			ТабличныйДокумент.Вывести(ОбластьСтрокаТаблицы);			
			
		КонецЦикла;
		
		// Вывод подвала таблицы движений
		ТабличныйДокумент.Вывести(ОбластьПодвалТаблицы);
		
		// Вывод подвала документа
		// !!!БИТ.СДЕЛАТЬ - вывод исполнителя по физ. лицу?
		ОбластьПодвал.Параметры.РасшифровкаПодписиИсполнителя = ТекДокумент.Ответственный;
		ТабличныйДокумент.Вывести(ОбластьПодвал);
		
	КонецЕсли;
	
	// Параметры макета по умолчанию.
	ТабличныйДокумент.ПолеСверху              = 10;
	ТабличныйДокумент.РазмерКолонтитулаСверху = 10;
	ТабличныйДокумент.ОриентацияСтраницы      = ОриентацияСтраницы.Ландшафт;
	ТабличныйДокумент.АвтоМасштаб 			  = Истина;
	
	Возврат ТабличныйДокумент;
		
КонецФункции

#КонецОбласти

#КонецЕсли
